app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all

INSERT INTO "items" ("category", "created_at", "description", "item_number", "name", "supplier_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_item
      @item = Item.find(params[:id])