app/controllers/sales_controller.rb

  def index
    @sales = Sale.all
---
SELECT "sales".* FROM "sales"